# Curso: Aprendizaje Automático
# Tarea2 - Tutorial Pandas
## Alonso Nuñez Sanchez
## Fecha de entrega: 29 julio 2019
# ---------------------------------------------

Pandas es una librería de Phyton usada para manejo de estructuras de datos. A continuación veremos cómo utilizar algunas de sus funciones, operadores, etc.
En la primera parte de este tutorial trabajamos con un dataFrame pequeño (menos de 10 filas) para presentar ejemplos básicos
En la segunda parte, después de cargar un dataset mayor (más de 20.000 instancias), pondremos en práctica algunos de los conceptos de la primera parte

### Importar dependencias:

In [1]:
import numpy as np
import pandas as pd

# PRIMERA PARTE DEL TUTORIAL

### Estructuras de datos

In [2]:
#DataFrames y Series
#Una serie es una estructura unidimensional (1 columna)
#Un DataFrame es una estructura multidimensional (n columnas)

#Crear una serie "manualmente"
colores = pd.Series(['Rojo', 'Azul', 'Blanco', 'Negro', 'Amarillo', 'Verde', 'Morado'],
index = [1, 2, 3, 4, 5, 6, 7])  #los índices se pueden nombrar a gusto

#Crear una dataFrame "manualmente"
empleados1 = {'Nombre' : ['Jose', 'Pedro', 'David', 'Luis', 'Antonio'],
          'Edad' : [32, 55, 20, 43, 30],
          'Departamento' : ['Contabilidad', 'Recursos Humanos', 'Administración', 'Sistemas', 'Mercadeo'],
          'Salario' : [1500, 1800, 500, 3500, 2000]}          
         
empleados1_df = pd.DataFrame(empleados1)

print ("Ejemplo series:\n",colores,"\n")
print ("Ejemplo data_frame:\n",empleados1_df)

Ejemplo series:
 1        Rojo
2        Azul
3      Blanco
4       Negro
5    Amarillo
6       Verde
7      Morado
dtype: object

Ejemplo data_frame:
     Nombre  Edad      Departamento  Salario
0     Jose    32      Contabilidad     1500
1    Pedro    55  Recursos Humanos     1800
2    David    20    Administración      500
3     Luis    43          Sistemas     3500
4  Antonio    30          Mercadeo     2000

In [3]:
#Concatenar 2 dataframes:
empleados2 = {'Direccion' : ['Cartago', 'Limon', 'Alajuela', 'Heredia', 'San Jose'],
          'Cedula' : [1234, 3215, 6742, 9854, 4321],          
          'Vacaciones' : [16, 8, 23, 4, 5]}          
         
empleados2_df = pd.DataFrame(empleados2)
empleados3_df = pd.concat([empleados1_df, empleados2_df], axis=1,)

print ("Ejemplo concatenar data_frame:\n",empleados3_df)

Ejemplo concatenar data_frame:
     Nombre  Edad      Departamento  Salario Direccion  Cedula  Vacaciones
0     Jose    32      Contabilidad     1500   Cartago    1234          16
1    Pedro    55  Recursos Humanos     1800     Limon    3215           8
2    David    20    Administración      500  Alajuela    6742          23
3     Luis    43          Sistemas     3500   Heredia    9854           4
4  Antonio    30          Mercadeo     2000  San Jose    4321           5

### Acceder a los índices

Hay varias formas de tener acceso al contenido del dataFrame
Algunas a continuación

Primeras n filas (head) y últimas n filas (tail)

In [4]:
#imprimir las primeras n filas (5 es el default)
print ("Primeras filas:")
print (empleados3_df.head(2))

print ("\nUltimas filas:")
#imprimir las últimas n filas (5 es el default)
print (empleados3_df.tail(2))

Primeras filas:
  Nombre  Edad      Departamento  Salario Direccion  Cedula  Vacaciones
0   Jose    32      Contabilidad     1500   Cartago    1234          16
1  Pedro    55  Recursos Humanos     1800     Limon    3215           8

Ultimas filas:
    Nombre  Edad Departamento  Salario Direccion  Cedula  Vacaciones
3     Luis    43     Sistemas     3500   Heredia    9854           4
4  Antonio    30     Mercadeo     2000  San Jose    4321           5

Acceso por índices, algunas a continuación:

In [5]:
# Por índice específico [n], [-1:] para el último, [-2:] para los 2 últimos, [-n] para los n últimos
print("El último [-1:]:\n", empleados3_df[-1:])

# Por rangos (del índice 0 al 2)
print("\nRango [0:2]:\n", empleados3_df[0:2])

# Por rangos (del índice 2 al 3)
print("\nRango [2:3]\n", empleados3_df[2:3])

# Por condición y etiquetas
print ("\nPor etiqueta, cuando El Nombre es igual a Luis:\n", empleados3_df.loc[empleados3_df['Nombre'] == 'Luis'])

El último [-1:]:
     Nombre  Edad Departamento  Salario Direccion  Cedula  Vacaciones
4  Antonio    30     Mercadeo     2000  San Jose    4321           5

Rango [0:2]:
   Nombre  Edad      Departamento  Salario Direccion  Cedula  Vacaciones
0   Jose    32      Contabilidad     1500   Cartago    1234          16
1  Pedro    55  Recursos Humanos     1800     Limon    3215           8

Rango [2:3]
   Nombre  Edad    Departamento  Salario Direccion  Cedula  Vacaciones
2  David    20  Administración      500  Alajuela    6742          23

Por etiqueta, cuando El Nombre es igual a Luis:
   Nombre  Edad Departamento  Salario Direccion  Cedula  Vacaciones
3   Luis    43     Sistemas     3500   Heredia    9854           4

### Insertar filas. En el ejemplo, un nuevo empleado en el indice 5 y 6

In [6]:
empleados3_df.loc[5] = ['Fernando', '24', 'Ingenieria', '1750', 'Cartago', '2541','0']
empleados3_df.loc[6] = ['Fernando', '24', 'Ingenieria', '1750', 'Cartago', '2541','0']
empleados3_df

     Nombre Edad      Departamento Salario Direccion Cedula Vacaciones
0      Jose   32      Contabilidad    1500   Cartago   1234         16
1     Pedro   55  Recursos Humanos    1800     Limon   3215          8
2     David   20    Administración     500  Alajuela   6742         23
3      Luis   43          Sistemas    3500   Heredia   9854          4
4   Antonio   30          Mercadeo    2000  San Jose   4321          5
5  Fernando   24        Ingenieria    1750   Cartago   2541          0
6  Fernando   24        Ingenieria    1750   Cartago   2541          0

### Eliminar datos

In [7]:
print ("DataFrame antes de eliminar datos\n", empleados3_df)

#conocer duplicados
print ("\n¿Hay filas duplicadas?\n")
print(empleados3_df.duplicated())

#eliminar duplicados
empleados3_df = empleados3_df.drop_duplicates()
print ("\nDataFrame después de eliminar duplicados\n", empleados3_df)

#duplicados por columna
empleados3_df = empleados3_df.drop_duplicates(['Direccion'])
print ("\nDataFrame después de eliminar duplicados en columna Direccion\n", empleados3_df)

#eliminar columna
empleados3_df = empleados3_df.drop(['Vacaciones'], axis=1)
print ("\nDataFrame después de eliminar la columna Vacaciones\n", empleados3_df)

empleados3_df

#Otros drop:
#eliminar fila
#empleados3_df.drop([0])

#eliminar rango de filas
##empleados3_df.drop(#empleados3_df.index[[0, 1]])

#eliminar ultima fila
##empleados3_df.drop(df.index[-1])

DataFrame antes de eliminar datos
      Nombre Edad      Departamento Salario Direccion Cedula Vacaciones
0      Jose   32      Contabilidad    1500   Cartago   1234         16
1     Pedro   55  Recursos Humanos    1800     Limon   3215          8
2     David   20    Administración     500  Alajuela   6742         23
3      Luis   43          Sistemas    3500   Heredia   9854          4
4   Antonio   30          Mercadeo    2000  San Jose   4321          5
5  Fernando   24        Ingenieria    1750   Cartago   2541          0
6  Fernando   24        Ingenieria    1750   Cartago   2541          0

¿Hay filas duplicadas?

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

DataFrame después de eliminar duplicados
      Nombre Edad      Departamento Salario Direccion Cedula Vacaciones
0      Jose   32      Contabilidad    1500   Cartago   1234         16
1     Pedro   55  Recursos Humanos    1800     Limon   3215          8
2     David   20    Administración     500  Alajuela   6742         23
3      Luis   43          Sistemas    3500   Heredia   9854          4
4   Antonio   30          Mercadeo    2000  San Jose   4321          5
5  Fernando   24        Ingenieria    1750   Cartago   2541          0

DataFrame después de eliminar duplicados en columna Direccion
     Nombre Edad      Departamento Salario Direccion Cedula Vacaciones
0     Jose   32      Contabilidad    1500   Cartago   1234         16
1    Pedro   55  Recursos Humanos    1800     Limon   3215          8
2    David   20    Administración     500  Alajuela   6742         23
3     Luis   43          Sistemas    3500   Heredia   9854          4
4  Antonio   30          Mercadeo    2000  San Jose   4321          5

DataFrame después de eliminar la columna Vacaciones
     Nombre Edad      Departamento Salario Direccion Cedula
0     Jose   32      Contabilidad    1500   Cartago   1234
1    Pedro   55  Recursos Humanos    1800     Limon   3215
2    David   20    Administración     500  Alajuela   6742
3     Luis   43          Sistemas    3500   Heredia   9854
4  Antonio   30          Mercadeo    2000  San Jose   4321

    Nombre Edad      Departamento Salario Direccion Cedula
0     Jose   32      Contabilidad    1500   Cartago   1234
1    Pedro   55  Recursos Humanos    1800     Limon   3215
2    David   20    Administración     500  Alajuela   6742
3     Luis   43          Sistemas    3500   Heredia   9854
4  Antonio   30          Mercadeo    2000  San Jose   4321

### Tipos de datos

In [8]:
#conocer tipos
print ("Tipos de datos antes de cambiarlos:\n",empleados3_df.dtypes)

#cambiar tipos
empleados3_df.Salario = empleados3_df.Salario.astype(int)

print ("\nTipos de datos después de cambiarlos:\n",empleados3_df.dtypes)

Tipos de datos antes de cambiarlos:
 Nombre          object
Edad            object
Departamento    object
Salario         object
Direccion       object
Cedula          object
dtype: object

Tipos de datos después de cambiarlos:
 Nombre          object
Edad            object
Departamento    object
Salario          int32
Direccion       object
Cedula          object
dtype: object

### Ordenar datos

In [9]:
#ordenar por nombre de forma ascendente:
print ("Ordenar por Nombre ascendente:\n", empleados3_df.sort_values(by=['Nombre']))

#ordenar por nombre de forma descendente:
print ("\nOrdenar por Salario de mayor a menor:\n", empleados3_df.sort_values(by=['Salario'], ascending=False))

Ordenar por Nombre ascendente:
     Nombre Edad      Departamento  Salario Direccion Cedula
4  Antonio   30          Mercadeo     2000  San Jose   4321
2    David   20    Administración      500  Alajuela   6742
0     Jose   32      Contabilidad     1500   Cartago   1234
3     Luis   43          Sistemas     3500   Heredia   9854
1    Pedro   55  Recursos Humanos     1800     Limon   3215

Ordenar por Salario de mayor a menor:
     Nombre Edad      Departamento  Salario Direccion Cedula
3     Luis   43          Sistemas     3500   Heredia   9854
4  Antonio   30          Mercadeo     2000  San Jose   4321
1    Pedro   55  Recursos Humanos     1800     Limon   3215
0     Jose   32      Contabilidad     1500   Cartago   1234
2    David   20    Administración      500  Alajuela   6742

# SEGUNDA PARTE DEL TUTORIAL

### Importar datos desde archivo .csv

In [10]:
# usando la función read_csv
# indicando que la columna 0 contiene los indices
# carga un dataset con los resultados de los finalistas en la Maraton de Boston 2017
df = pd.read_csv('https://raw.githubusercontent.com/anunezcr/datasets/master/marathon_results_2017.csv', index_col = 0)
print ("listo!!")

listo!!

In [11]:
# .shape indica la forma del DataFrame (filas y columnas)
df.shape

(26410, 24)

In [12]:
#top 10 en la clasificación general
print (df.head(10))

  Bib                Name  Age M/F              City State Country Citizen  \
0  11     Kirui, Geoffrey   24   M          Keringet   NaN     KEN     NaN
1  17         Rupp, Galen   30   M          Portland    OR     USA     NaN
2  23       Osako, Suguru   25   M      Machida-City   NaN     JPN     NaN
3  21    Biwott, Shadrack   32   M     Mammoth Lakes    CA     USA     NaN
4   9      Chebet, Wilson   31   M          Marakwet   NaN     KEN     NaN
5  15    Abdirahman, Abdi   40   M           Phoenix    AZ     USA     NaN
6  63  Maiyo, Augustus K.   33   M  Colorado Springs    CO     USA     NaN
7   7         Sefir, Dino   28   M       Addis Ababa   NaN     ETH     NaN
8  18      Puskedra, Luke   27   M            Eugene    OR     USA     NaN
9  20         Ward, Jared   28   M         Kaysville    UT     USA     NaN

  Unnamed: 9       5K  ...      25K      30K      35K      40K     Pace  \
0        NaN  0:15:25  ...  1:16:59  1:33:01  1:48:19  2:02:53  0:04:57
1        NaN  0:15:24  ...  1:16:59  1:33:01  1:48:19  2:03:14  0:04:58
2        NaN  0:15:25  ...  1:17:00  1:33:01  1:48:31  2:03:38  0:04:59
3        NaN  0:15:25  ...  1:17:00  1:33:01  1:48:58  2:04:35  0:05:03
4        NaN  0:15:25  ...  1:16:59  1:33:01  1:48:41  2:05:00  0:05:04
5        NaN  0:15:25  ...  1:16:59  1:33:01  1:48:52  2:05:21  0:05:04
6        NaN  0:15:25  ...  1:17:00  1:33:01  1:49:06  2:05:41  0:05:05
7        NaN  0:15:24  ...  1:18:36  1:34:52  1:51:11  2:07:09  0:05:08
8        NaN  0:15:24  ...  1:17:26  1:34:05  1:50:53  2:07:17  0:05:09
9        NaN  0:15:25  ...  1:17:17  1:33:49  1:50:44  2:07:54  0:05:11

  Proj Time Official Time Overall Gender Division
0         -       2:09:37       1      1        1
1         -       2:09:58       2      2        2
2         -       2:10:28       3      3        3
3         -       2:12:08       4      4        4
4         -       2:12:35       5      5        5
5         -       2:12:45       6      6        1
6         -       2:13:16       7      7        6
7         -       2:14:26       8      8        7
8         -       2:14:45       9      9        8
9         -       2:15:28      10     10        9

[10 rows x 24 columns]

### Reducir las 24 columnas solo a las que nos interesa para el ejemplo

In [13]:
cols_to_use = ['Bib', 'Name', 'Age','M/F','Country', 'Official Time', 'Overall']
df = df[cols_to_use]
print (df.head(10))

  Bib                Name  Age M/F Country Official Time  Overall
0  11     Kirui, Geoffrey   24   M     KEN       2:09:37        1
1  17         Rupp, Galen   30   M     USA       2:09:58        2
2  23       Osako, Suguru   25   M     JPN       2:10:28        3
3  21    Biwott, Shadrack   32   M     USA       2:12:08        4
4   9      Chebet, Wilson   31   M     KEN       2:12:35        5
5  15    Abdirahman, Abdi   40   M     USA       2:12:45        6
6  63  Maiyo, Augustus K.   33   M     USA       2:13:16        7
7   7         Sefir, Dino   28   M     ETH       2:14:26        8
8  18      Puskedra, Luke   27   M     USA       2:14:45        9
9  20         Ward, Jared   28   M     USA       2:15:28       10

### Valida cantidad de nulos y ceros por columna, para medir la calidad de los datos (después de haber filtrado solo las columnas de interés)

In [14]:
print("Ceros por columna:")
print((df == 0).astype(int).sum())
print("\nNulos por columna:")
print(df.isnull().sum())

Ceros por columna:
Bib              0
Name             0
Age              0
M/F              0
Country          0
Official Time    0
Overall          0
dtype: int64

Nulos por columna:
Bib              0
Name             0
Age              0
M/F              0
Country          0
Official Time    0
Overall          0
dtype: int64

### Resumen de estadísticas del dataFrame

In [15]:
print(df.describe())

                Age       Overall
count  26410.000000  26410.000000
mean      42.587732  13206.260091
std       11.419467   7624.370496
min       18.000000      1.000000
25%       34.000000   6604.250000
50%       43.000000  13206.500000
75%       51.000000  19808.750000
max       84.000000  26411.000000

In [16]:
from statistics import mean, median
# algunos datos sobre la edad de los participantes:

print ("La menor edad es:", min(df.Age))
print ("La mayor edad es:", max(df.Age))
print ("La media de la edad es:", mean(df.Age))
print ("La mediana de la edad es:", median(df.Age))

La menor edad es: 18
La mayor edad es: 84
La media de la edad es: 42.587731919727375
La mediana de la edad es: 43.0

### Mostrar los corredores de menor y mayor edad (de entre todos los participantes)

In [17]:
print ("Corredores de menor edad:\n", df.loc[df['Age'] == min(df.Age)])
print ("\nCorredores de mayor edad:\n", df.loc[df['Age'] == max(df.Age)])

Corredores de menor edad:
          Bib                  Name  Age M/F Country Official Time  Overall
3748    5220     Eastmond, Riley J   18   M     USA       3:15:20     3749
4084    3603           Fickes, Ben   18   M     USA       3:17:16     4085
4735    4496         Moore, Ryan D   18   M     USA       3:20:23     4736
5443   27556       Umphrey, Duncan   18   M     USA       3:23:44     5444
7377    4083          Nelson, Alex   18   M     USA       3:31:22     7379
8432   29072        Rezuke, Joseph   18   M     USA       3:35:16     8434
15919  15125        Rucker, Alyssa   18   F     USA       4:01:22    15921
15931  30496    Pohl, Elizabeth S.   18   F     USA       4:01:25    15933
16499  30146        Canzano, James   18   M     USA       4:04:06    16501
17735  26356       Fried, Lucas A.   18   M     USA       4:10:23    17737
18487  28294     Georgaklis, Sofia   18   F     USA       4:14:12    18489
21575  30213          Joy, Ryan A.   18   M     USA       4:34:40    21577
22054  27702   Canfield, Hallie F.   18   F     USA       4:38:46    22056
22410  30098     Cohen, Natalie G.   18   F     USA       4:42:36    22412
22938  28542      Blake, Meghan E.   18   F     USA       4:47:48    22940
23251  27454     Mahoney, Tyler S.   18   F     USA       4:51:25    23253
23371  27688  Pushner, Jennifer L.   18   F     USA       4:53:04    23373
24323  25291     Tiberi, Sophia C.   18   F     USA       5:06:07    24325
25459  25946  Waring, Elizabeth L.   18   F     USA       5:29:31    25461
26328  30353   MacDonald, Grace C.   18   F     USA       6:03:14    26330

Corredores de mayor edad:
          Bib               Name  Age M/F Country Official Time  Overall
26340  25269  Beiers, Katherine   84   F     USA       6:04:07    26342

### Mostrar los corredores costarricenses, filtros y ordenamiento de datos

In [18]:
#filtrar los corredores costarricenses, condición en country para el data frame original:
#crea un nuevo dataframe (df_CRC) con el resultado
df_CRC = df.loc[df['Country'] == 'CRC']

#filtrar los costarricenses hombres, condición en la característica M/F (M= masculino, F= femenino)
df_CRC_M = df_CRC.loc[df_CRC['M/F'] == 'M']

#filtrar los costarricenses mujeres
df_CRC_F = df_CRC.loc[df_CRC['M/F'] == 'F']

#ordenar por nombre de forma ascendente según posición:
print ("Top 10 hombres costarricenses:\n", df_CRC_M.sort_values(by=['Overall']).head(10))
print ("\nTop 10 mujeres costarricenses:\n", df_CRC_F.sort_values(by=['Overall']).head(10))

#Mostrar los 10 corredores costarricenses de menor edad
print ("\n10 costarricenses de menor edad:\n", df_CRC.sort_values(by=['Age']).head(10))

#Mostrar los 10 corredores costarricenses de mayor edad
print ("\n10 costarricenses de mayor edad:\n", df_CRC.sort_values(by=['Age']).tail(10))

Top 10 hombres costarricenses:
        Bib                            Name  Age M/F Country Official Time  \
289    947                  Lazo, Reynaldo   35   M     CRC       2:43:54
307    915            Zuniga Ruiz, Esteban   31   M     CRC       2:44:25
430   1310            Bolanos, Antonio Sr.   27   M     CRC       2:47:16
487   2125         Fernández Jiménez, Luis   32   M     CRC       2:48:27
678   1536  Melendez, Carlos Manuel M. Sr.   38   M     CRC       2:51:45
749    904               Castro, Sebastian   31   M     CRC       2:52:51
783   2260       Mena Solorzano, Diego Sr.   34   M     CRC       2:53:17
1063   342          Serrano Ulloa, Abraham   24   M     CRC       2:56:50
1065  1947                  Weinstok, Leon   32   M     CRC       2:56:50
1374  3418      Ramires Arguedas, Geovanni   45   M     CRC       2:59:23

      Overall
289       290
307       308
430       431
487       488
678       679
749       750
783       784
1063     1064
1065     1066
1374     1375

Top 10 mujeres costarricenses:
         Bib                       Name  Age M/F Country Official Time  Overall
1623   3684   Bogantes Gonzalez, Diana   28   F     CRC       3:01:46     1624
1644   8379          Corazzari, Andrea   38   F     CRC       3:01:56     1645
2854   2961     Herra Arroyo, Gabriela   37   F     CRC       3:10:12     2855
3070   4537      Miranda, Ana Catalina   41   F     CRC       3:11:27     3071
3366  11280               Marin, Laura   39   F     CRC       3:13:23     3367
3448   7177           Carazo, Gloriana   25   F     CRC       3:13:48     3449
4426   5874       Hernandez, Elizabeth   35   F     CRC       3:18:58     4427
5009  17392          Acuña, Ivannia C.   36   F     CRC       3:21:39     5010
6200  10845        Santillan, Laura C.   26   F     CRC       3:26:47     6201
6525  12702  Calderon Jimenez, Natalia   26   F     CRC       3:28:02     6527

10 costarricenses de menor edad:
         Bib                       Name  Age M/F Country Official Time  Overall
1063    342     Serrano Ulloa, Abraham   24   M     CRC       2:56:50     1064
3448   7177           Carazo, Gloriana   25   F     CRC       3:13:48     3449
6200  10845        Santillan, Laura C.   26   F     CRC       3:26:47     6201
6525  12702  Calderon Jimenez, Natalia   26   F     CRC       3:28:02     6527
430    1310       Bolanos, Antonio Sr.   27   M     CRC       2:47:16      431
5258   5822       Gutierrez, Alejandro   27   M     CRC       3:22:52     5259
1623   3684   Bogantes Gonzalez, Diana   28   F     CRC       3:01:46     1624
2826   3579    Carvajal Brenes, Andres   29   M     CRC       3:10:01     2827
307     915       Zuniga Ruiz, Esteban   31   M     CRC       2:44:25      308
749     904          Castro, Sebastian   31   M     CRC       2:52:51      750

10 costarricenses de mayor edad:
          Bib                         Name  Age M/F Country Official Time  \
14269  22891               Arce, Eleonora   48   F     CRC       3:55:14
19521  23229     Rojas Saborio, Ingrid M.   50   F     CRC       4:19:57
15739  12333              Aguero, Jose F.   50   M     CRC       4:00:28
21083  14427  Hidalgo Gallegos, Francisco   53   M     CRC       4:30:25
19243  18546   Vargas Solano, Oscar Mario   55   M     CRC       4:18:19
13121  12451         Carazo, Marco E. Sr.   55   M     CRC       3:51:19
18168  24360               Vives, Marcela   60   F     CRC       4:12:26
10045  12250             Rodriguez, Mario   60   M     CRC       3:41:05
24391  31168             Castro, Bernardo   62   M     CRC       5:07:10
20784  24085       Cruz Castillo, Joaquin   73   M     CRC       4:28:21

       Overall
14269    14271
19521    19523
15739    15741
21083    21085
19243    19245
13121    13123
18168    18170
10045    10047
24391    24393
20784    20786